# MEPCalculationServerInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCalculationServerInfo Constructor
MEPCalculationServerInfo Class See Also
---
Constructs a new MEPCalculationServerInfo with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPCalculationServerInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
MEPCalculationServerInfo()
```

# See Also
MEPCalculationServerInfo Class
MEPCalculationServerInfo Overload
Autodesk.Revit.DB Namespace